Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateThis Property
 Can't create [Element].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateThis { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateThis As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateThis {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace